//CTLLCAB2 JOB
/* LIST CATALOG INFORMATION FOR VSAM
//LISTCAT  EXEC  PGM=IDCAMS
//SYSPRINT DD    SYSOUT=A
//SYSIN    DD    *
     LISTCAT -
           ENTRIES(KC03AB2.AX.CICS.CTLAB2) -
           CLUSTER -
           ALL
/*