       01  INVCTL-RECORD.
      *
           05  INVCTL-RECORD-KEYGRP.
               10  INVCTL-RECORD-KEY           PIC 9(01).
           05  INVCTL-NEXT-INVOICE-NUMBER      PIC 9(06).
      *