       01  PRODUCT-MASTER-RECORD.
      *
           05  PRD-KEY.
               10  PRD-PRODUCT-CODE            PIC X(10).
           05  PRD-PRODUCT-DESCRIPTION         PIC X(20).
           05  PRD-UNIT-PRICE                  PIC S9(07)V99.
           05  PRD-QUANTITY-ON-HAND            PIC S9(07).
      *